package com.feng.pigp.fans.service;

import com.feng.pigp.fans.model.Goal;
import com.google.common.base.Splitter;
import com.google.common.collect.Lists;
import org.apache.commons.lang3.StringUtils;
import org.springframework.stereotype.Service;

import java.util.List;
import java.util.Random;

/**
 * @author feng
 * @date 2019/7/12 14:03
 * @since 1.0
 */
@Service
public class CommentPoolService {

    private static final Random RANDOM = new Random();
    private static final List<String> list = Lists.newArrayList("不", "人", "在", "他", "有", "这", "个", "上", "们", "来", "到", "时", "大", "地", "为", "子", "中", "你", "说", "生", "年", "着", "就", "那", "和", "要", "她", "出", "也", "得", "里", "后", "自", "以", "会", "家", "可", "下", "而", "过", "天", "去", "能", "对", "小", "多", "然", "于", "心", "学", "么", "之", "都", "好", "看", "起", "发", "当", "没", "成", "只", "如", "事", "把", "还", "用", "第", "样", "道", "想", "作", "种", "开", "美", "总", "从", "无", "情", "己", "面", "最", "但", "现", "前", "些", "所", "同", "手", "又", "行", "意", "动", "方", "期", "它", "经", "长", "儿", "回", "位", "分", "爱", "老", "因", "很", "给", "名", "法", "间", "斯", "知", "世", "什", "两", "次", "使", "身", "者", "被", "高", "已", "亲", "其", "进", "此", "话", "常", "与", "活", "正", "感", "见", "明", "问", "力", "理", "尔", "点", "文", "几", "定", "本", "公", "特", "做", "外", "孩", "相", "西", "果", "走", "将", "月", "十", "实", "向", "声", "车", "全", "信", "重", "三", "机", "工", "物", "气", "每", "并", "别", "真", "打", "太", "新", "比", "才", "便", "夫", "再", "书", "部", "水", "像", "眼", "等", "体", "却", "加", "电", "主", "界", "门", "利", "海", "受", "听", "表", "德", "少", "克", "代", "员", "许", "稜", "先", "口", "由", "写", "马", "光", "白", "或", "住", "难", "望", "教", "命", "花", "结", "乐", "色", "更", "拉", "东", "神", "记", "处", "让", "母", "父", "应", "直", "字", "场", "平", "报", "友", "关", "放", "至", "张", "认", "接", "告", "入", "笑", "内", "英", "军", "候", "民", "岁", "往", "何", "度", "山", "觉", "路", "带", "万", "男", "边", "风", "解", "叫", "任", "金", "快", "原", "吃", "妈", "变", "通", "师", "立", "象", "数", "四", "失", "满", "战", "远", "格", "士", "音", "轻", "目", "条", "呢", "始", "达", "深", "完", "今", "提", "求", "清", "王", "化", "空", "业", "思", "切", "怎", "非", "找", "片", "罗", "钱", "紶", "吗", "语", "元", "喜", "曾", "离", "飞", "科", "言", "干", "流", "欢", "约", "各", "即", "指", "合", "反", "题", "必", "该", "论", "交", "终", "林", "请", "医", "晚", "制", "球", "决", "窢", "传", "画", "保", "读", "运", "及", "则", "房", "早", "院", "量", "苦", "火", "布", "品", "近", "坐", "答", "星", "精", "视", "五", "连", "司", "巴", "奇", "管", "类", "未", "朋", "且", "台", "夜", "青", "北", "队", "久", "乎", "越", "观", "落", "尽", "形", "影", "红", "百", "令", "周", "吧", "识", "步", "希", "亚", "术", "留", "市", "半", "热", "送", "兴", "造", "谈", "容", "极", "随", "演", "收", "首", "根", "讲", "整", "式", "取", "照", "办", "强", "石", "古", "华", "諣", "拿", "计", "您", "装", "似", "足", "双", "妻", "尼", "转", "诉", "米", "称", "丽", "客", "南", "领", "节", "衣", "站", "刻", "统", "福", "城", "故", "历", "惊", "脸", "选", "包", "紧", "争", "另", "建", "维", "绝", "树", "系", "伤", "示", "愿", "持", "千", "史", "谁", "准", "联", "妇", "纪", "基", "买", "志", "静", "阿", "诗", "独", "复", "痛", "消", "社", "算", "算", "义", "竟", "确", "需", "单", "治", "卡", "幸", "兰", "念", "举", "仅", "钟", "怕", "共", "毛", "句", "息", "功", "官", "待", "究", "跟", "穿", "室", "易", "游", "程", "号", "居", "考", "突", "皮", "哪", "费", "倒", "价", "图", "具", "刚", "脑", "永", "歌", "响", "商", "礼", "细", "专", "黄", "块", "脚", "味", "改", "据", "般", "引", "食", "仍", "存", "众", "注", "笔", "甚", "某", "沉", "备", "习", "校", "默", "务", "土", "微", "须", "试", "怀", "料", "调", "广", "苏", "显", "赛", "查", "密", "议", "底", "列", "富", "梦", "错", "座", "参", "八", "除", "跑", "亮", "假", "印", "设", "线", "温", "虽", "掉", "初", "养", "香", "停", "际", "致", "阳", "纸", "李", "纳", "验", "助", "激", "够", "严", "证", "帝", "饭", "忘", "趣", "支", "春", "集", "丈", "木", "研", "班", "普", "导", "顿", "睡", "展", "跳", "获", "艺", "六", "波", "察", "群", "皇", "段", "急", "庭", "创", "区", "奥", "器", "谢", "弟", "店", "否", "草", "排", "背", "止", "组", "州", "朝", "封", "睛", "板", "角", "况", "曲", "馆", "育", "忙", "质", "河", "续", "哥", "呼", "若", "推", "境", "遇", "雨", "标", "姐", "充", "围", "案", "伦", "护", "冷", "警", "贝", "著", "雪", "索", "剧", "啊", "船", "依", "斗", "值", "帮", "汉", "慢", "佛", "肯", "闻", "唱", "沙", "局", "伯", "族", "低", "玩", "资", "屋", "击", "速", "顾", "泪", "洲", "团", "圣", "旁", "堂", "兵", "七", "露", "园", "牛", "哭", "旅", "街", "劳", "型", "烈", "姑", "陈", "莫", "鱼", "异", "抱", "宝", "权", "鲁", "简", "态", "级", "票", "怪", "寻", "杀", "律", "胜", "份", "汽", "右", "洋", "范", "床", "舞", "秘", "午", "登", "楼", "贵", "吸", "责", "例", "追", "较", "职", "属", "渐", "左", "录", "丝", "牙", "继", "托", "赶", "章", "智", "冲", "叶", "胡", "吉", "卖", "坚", "喝", "肉", "遗", "修", "松", "临", "藏", "担", "戏", "善", "卫", "悲", "敢", "靠", "伊", "村", "戴", "词", "森", "耳", "差", "短", "祖", "云", "规", "窗", "散", "迷", "油", "旧", "适", "乡", "架", "恩", "投", "弹", "铁", "博", "雷", "府", "压", "超", "勒", "杂", "醒", "洗", "采", "毫", "嘴", "毕", "九", "冰", "既", "状", "景", "席", "珍", "顶", "派", "素", "农", "疑", "练", "野", "按", "拍", "征", "骨", "余", "承", "置", "彩", "灯", "巨", "琴", "免", "环", "姆", "换", "技", "翻", "束", "增", "忍", "餐", "洛", "塞", "缺", "忆", "判", "欧", "层", "付", "阵", "玛", "批", "岛", "项", "休", "懂", "武", "革", "良", "恋", "委", "拥", "娜", "妙", "探", "呀", "营", "摇", "弄", "桌", "熟", "诺", "宣", "银", "势", "奖", "宫", "忽", "套", "康", "供", "优", "课", "鸟", "喊", "降", "夏", "困", "刘", "鞋", "健", "模", "败", "伴", "守", "挥", "鲜", "财", "伙", "杰", "迹", "妹", "藸", "遍", "盖", "副", "坦", "牌", "江", "顺", "秋", "菜", "划", "授", "归", "浪", "听", "凡", "预", "奶", "雄", "升", "碃", "编", "典", "袋", "莱", "含", "盛", "济", "蒙", "棋", "端", "腿", "招", "释", "介", "误");
    private static final String defaultValue = "大风小";
    private static final int SIZE;

    static{
        SIZE = list.size();
    }

    public String queryCommentWithShare(Goal goal, String topic){

        String randomMessage = getRandomMesage();
        return "#"+topic+"#@"+ goal.getUserName()+defaultValue+randomMessage;
    }


    public String queryCommentWithComment(Goal goal, String topic){

        return defaultValue + getRandomMesage() + "@" + goal.getUserName();
    }

    public String queryCommentWithInternalComment(Goal goal, String topic){

        return defaultValue + getRandomMesage();
    }

    public String getRandomMesage() {

        StringBuilder sb = new StringBuilder();
        for(int i=0; i<15; i++){
            sb.append(list.get(RANDOM.nextInt(SIZE)));
        }
        return sb.toString();
    }
}